## 24-PandasOperations

In [14]:
# Eksik veri olduğunda ne yapılır?

In [3]:
import numpy as np
import pandas as pd

In [16]:
sozlukVerisi = {"İstanbul": [30,29,np.nan], "Ankara" : [20, np.nan, 25], "İzmir": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [17]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [18]:
# olmayan veriler silinebilir. O zaman ne olur?

havaDurumuDataFrame.dropna()    #olmayan verilerin olduğu satırları siler ama orijinal dataframe bozulmaz.

   İstanbul  Ankara  İzmir
0      30.0    20.0     40

In [19]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [20]:
havaDurumuDataFrame.dropna(axis=1)  # Na olmayan column'u getirir, Na olanları siler

   İzmir
0     40
1     39
2     38

In [21]:
sozlukVerisi2 = {"İstanbul": [30,29,np.nan], "Ankara" : [20, np.nan, 25], "İzmir": [40,39,38], "Antalya": [45, np.nan, np.nan]}
havaDurumuDataFrame2 = pd.DataFrame(sozlukVerisi2)

In [22]:
havaDurumuDataFrame2

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [26]:
# Burda column'da bir tane Nan varsa al, daha fazla Nan varsa o column'u alma: threshold =2, eşik

havaDurumuDataFrame2.dropna(axis=1, thresh=2)

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [33]:
# Nan yazan yerlere belli bir sayı veya ortalamasını yazmayı düşünebiliriz

havaDurumuDataFrame2.fillna(20)    # boş olan yerlere 20 yaz

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby:

In [36]:
# veriyi gruplamak için . Veri analizinde çok önemli

In [1]:
maasDictionary = {"Departman" :["Yazılım", "Yazılım", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"],
                  "Çalışan İsimleri": ["Ahmet", "Mehmet", "Ali", "Zeyneb", "Burak", "Fatma"],
                  "Maaş": [100,150,200,300,400,500]}

In [4]:
maasDataFrame = pd.DataFrame(maasDictionary)

In [5]:
maasDataFrame

   Departman Çalışan İsimleri  Maaş
0    Yazılım            Ahmet   100
1    Yazılım           Mehmet   150
2  Pazarlama              Ali   200
3  Pazarlama           Zeyneb   300
4      Hukuk            Burak   400
5      Hukuk            Fatma   500

In [6]:
groupbyObject= maasDataFrame.groupby("Departman")  #Departmana göre gruplanır, grupObject'de bir çok özellik var

In [7]:
groupbyObject.count()

           Çalışan İsimleri  Maaş
Departman
Hukuk                     2     2
Pazarlama                 2     2
Yazılım                   2     2

In [8]:
groupbyObject.mean()  ## Kişilerin ortalama maaşlarını gösterir

<ipython-input-8-84e482d649e9>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groupbyObject.mean()  ## Kişilerin ortalama maaşlarını gösterir

            Maaş
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [9]:
groupbyObject.min()

          Çalışan İsimleri  Maaş
Departman
Hukuk                Burak   400
Pazarlama              Ali   200
Yazılım              Ahmet   100

In [10]:
groupbyObject.max()

          Çalışan İsimleri  Maaş
Departman
Hukuk                Fatma   500
Pazarlama           Zeyneb   300
Yazılım             Mehmet   150

In [11]:
groupbyObject.describe()  # gruplanmış dataframe'in bütün özelliklerini getirir

           Maaş
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0